; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-2-6-211)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p2-0 - location
	p2-3 - location
	p2-4 - location
	p4-3 - location
	p0-1 - location
	p0-4 - location
	p1-2 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s0)
	(at driver3 s2)
	(at truck1 s2)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s3)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at package1 s0)
	(at package2 s4)
	(at package3 s1)
	(at package4 s4)
	(at package5 s4)
	(at package6 s2)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 2)
	(= (time-to-walk p2-0 s2) 2)
	(= (time-to-walk s0 p2-0) 2)
	(= (time-to-walk p2-0 s0) 2)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 1)
	(= (time-to-walk p2-3 s2) 1)
	(= (time-to-walk s3 p2-3) 1)
	(= (time-to-walk p2-3 s3) 1)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(= (time-to-walk s2 p2-4) 1)
	(= (time-to-walk p2-4 s2) 1)
	(= (time-to-walk s4 p2-4) 2)
	(= (time-to-walk p2-4 s4) 2)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(= (time-to-walk s4 p4-3) 2)
	(= (time-to-walk p4-3 s4) 2)
	(= (time-to-walk s3 p4-3) 2)
	(= (time-to-walk p4-3 s3) 2)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 1)
	(= (time-to-walk p0-1 s0) 1)
	(= (time-to-walk s1 p0-1) 2)
	(= (time-to-walk p0-1 s1) 2)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(= (time-to-walk s0 p0-4) 2)
	(= (time-to-walk p0-4 s0) 2)
	(= (time-to-walk s4 p0-4) 1)
	(= (time-to-walk p0-4 s4) 1)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 2)
	(= (time-to-walk p1-2 s1) 2)
	(= (time-to-walk s2 p1-2) 2)
	(= (time-to-walk p1-2 s2) 2)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 1)
	(= (time-to-drive s2 s3) 1)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 1)
	(= (time-to-drive s4 s3) 1)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 1)
	(= (time-to-drive s1 s4) 1)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 2)
	(= (time-to-drive s1 s0) 2)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 2)
	(= (time-to-drive s2 s0) 2)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 1)
	(= (time-to-drive s3 s0) 1)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver2 s4)
	(at driver3 s3)
	(at truck1 s1)
	(at package1 s0)
	(at package2 s3)
	(at package3 s2)
	(at package4 s0)
	(at package5 s1)
	(at package6 s4)
	))

(:metric minimize (+ (* 3 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (board-truck driver3 truck1 s2)
   deleted: (at driver3 s2) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 1 of 9
2. (walk driver2 s0 p0-4)
   deleted: (at driver2 s0)
   added: (at driver2 p0-4)
   goals met: 1 of 9
3. (walk driver2 p0-4 s4)
   deleted: (at driver2 p0-4)
   added: (at driver2 s4)
   goals met: 2 of 9
4. (load-truck package6 truck1 s2)
   deleted: (at package6 s2)
   added: (in package6 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 2 of 9
5. (drive-truck truck1 s2 s3 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   changed: (fuel-used) from 0 to 11
   goals met: 2 of 9
6. (drive-truck truck1 s3 s4 driver3)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   changed: (fuel-used) from 11 to 22
   goals met: 2 of 9
7. (unload-truck package6 truck1 s4)
   deleted: (in package6 truck1)
   added: (at package6 s4)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 3 of 9
8. (load-truck package2 truck1 s4)
   deleted: (at package2 s4)
   added: (in package2 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 3 of 9
9. (load-truck package4 truck1 s4)
   deleted: (at package4 s4)
   added: (in package4 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 3 of 9
10. (load-truck package5 truck1 s4)
   deleted: (at package5 s4)
   added: (in package5 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 3 of 9
11. (drive-truck truck1 s4 s1 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   changed: (fuel-used) from 22 to 38
   goals met: 4 of 9
12. (unload-truck package5 truck1 s1)
   deleted: (in package5 truck1)
   added: (at package5 s1)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 5 of 9
13. (load-truck package3 truck1 s1)
   deleted: (at package3 s1)
   added: (in package3 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 5 of 9
14. (drive-truck truck1 s1 s0 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (fuel-used) from 38 to 70
   goals met: 4 of 9
15. (unload-truck package4 truck1 s0)
   deleted: (in package4 truck1)
   added: (at package4 s0)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 5 of 9
16. (drive-truck truck1 s0 s3 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   changed: (fuel-used) from 70 to 83
   goals met: 5 of 9
17. (disembark-truck driver3 truck1 s3)
   deleted: (driving driver3 truck1)
   added: (at driver3 s3) (empty truck1)
   goals met: 6 of 9
18. (board-truck driver3 truck2 s3)
   deleted: (at driver3 s3) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 5 of 9
19. (drive-truck truck2 s3 s2 driver3)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   changed: (fuel-used) from 83 to 93
   goals met: 5 of 9
20. (unload-truck package2 truck1 s3)
   deleted: (in package2 truck1)
   added: (at package2 s3)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 6 of 9
21. (unload-truck package3 truck1 s3)
   deleted: (in package3 truck1)
   added: (at package3 s3)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 6 of 9
22. (drive-truck truck2 s2 s3 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   changed: (fuel-used) from 93 to 103
   goals met: 6 of 9
23. (load-truck package3 truck2 s3)
   deleted: (at package3 s3)
   added: (in package3 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 6 of 9
24. (drive-truck truck2 s3 s2 driver3)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   changed: (fuel-used) from 103 to 114
   goals met: 6 of 9
25. (walk driver2 s4 p4-3)
   deleted: (at driver2 s4)
   added: (at driver2 p4-3)
   goals met: 5 of 9
26. (drive-truck truck2 s2 s3 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   changed: (fuel-used) from 114 to 125
   goals met: 5 of 9
27. (disembark-truck driver3 truck2 s3)
   deleted: (driving driver3 truck2)
   added: (at driver3 s3) (empty truck2)
   goals met: 6 of 9
28. (unload-truck package3 truck2 s3)
   deleted: (in package3 truck2)
   added: (at package3 s3)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 6 of 9
29. (walk driver2 p4-3 s3)
   deleted: (at driver2 p4-3)
   added: (at driver2 s3)
   goals met: 6 of 9
30. (board-truck driver3 truck1 s3)
   deleted: (at driver3 s3) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 5 of 9
31. (drive-truck truck1 s3 s4 driver3)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   changed: (fuel-used) from 125 to 135
   goals met: 5 of 9
32. (drive-truck truck1 s4 s1 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   changed: (fuel-used) from 135 to 145
   goals met: 6 of 9
33. (board-truck driver2 truck2 s3)
   deleted: (at driver2 s3) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 6 of 9
34. (drive-truck truck1 s1 s4 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   changed: (fuel-used) from 145 to 155
   goals met: 5 of 9
35. (drive-truck truck2 s3 s2 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   changed: (fuel-used) from 155 to 165
   goals met: 5 of 9
36. (drive-truck truck1 s4 s3 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s3)
   changed: (fuel-used) from 165 to 175
   goals met: 5 of 9
37. (disembark-truck driver3 truck1 s3)
   deleted: (driving driver3 truck1)
   added: (at driver3 s3) (empty truck1)
   goals met: 6 of 9
38. (disembark-truck driver2 truck2 s2)
   deleted: (driving driver2 truck2)
   added: (at driver2 s2) (empty truck2)
   goals met: 6 of 9
39. (walk driver2 s2 p2-4)
   deleted: (at driver2 s2)
   added: (at driver2 p2-4)
   goals met: 6 of 9
40. (board-truck driver3 truck1 s3)
   deleted: (at driver3 s3) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 5 of 9
41. (drive-truck truck1 s3 s4 driver3)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   changed: (fuel-used) from 175 to 185
   goals met: 5 of 9
42. (drive-truck truck1 s4 s1 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   changed: (fuel-used) from 185 to 195
   goals met: 6 of 9
43. (board-truck driver1 truck2 s2)
   deleted: (at driver1 s2) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 6 of 9
44. (walk driver2 p2-4 s4)
   deleted: (at driver2 p2-4)
   added: (at driver2 s4)
   goals met: 7 of 9
45. (drive-truck truck1 s1 s0 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (fuel-used) from 195 to 215
   goals met: 6 of 9
46. (drive-truck truck2 s2 s3 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   changed: (fuel-used) from 215 to 225
   goals met: 6 of 9
47. (drive-truck truck1 s0 s3 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   changed: (fuel-used) from 225 to 235
   goals met: 6 of 9
48. (load-truck package3 truck1 s3)
   deleted: (at package3 s3)
   added: (in package3 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 6 of 9
49. (drive-truck truck1 s3 s2 driver3)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   changed: (fuel-used) from 235 to 246
   goals met: 6 of 9
50. (unload-truck package3 truck1 s2)
   deleted: (in package3 truck1)
   added: (at package3 s2)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 7 of 9
51. (drive-truck truck1 s2 s3 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   changed: (fuel-used) from 246 to 256
   goals met: 7 of 9
52. (disembark-truck driver3 truck1 s3)
   deleted: (driving driver3 truck1)
   added: (at driver3 s3) (empty truck1)
   goals met: 8 of 9
53. (disembark-truck driver1 truck2 s3)
   deleted: (driving driver1 truck2)
   added: (at driver1 s3) (empty truck2)
   goals met: 8 of 9
54. (board-truck driver1 truck1 s3)
   deleted: (at driver1 s3) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 8 of 9
55. (drive-truck truck1 s3 s0 driver1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   changed: (fuel-used) from 256 to 266
   goals met: 8 of 9
56. (drive-truck truck1 s0 s1 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   changed: (fuel-used) from 266 to 286
   goals met: 9 of 9
